### 3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [1]:
import pandas as pd  
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns
from sqlalchemy import create_engine, text
%matplotlib inline

In [2]:
database_name = 'scooters' #reads in scooters database

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

In [3]:
query = '''
SELECT companyname, sumdid, CAST(pubdatetime AS DATE) as date, COUNT(*)
FROM scooters
GROUP BY companyname, sumdid, CAST(pubdatetime AS DATE);
'''

with engine.connect() as connection:    
    avail = pd.read_sql(text(query), con = connection)

avail.head() #pulls in availablity table for scooters

  companyname        sumdid        date  count
0        Bird  Powered11MUW  2019-07-26     15
1        Bird  Powered11MUW  2019-07-27    193
2        Bird  Powered11MUW  2019-07-28    123
3        Bird  Powered11MUW  2019-07-29     69
4        Bird  Powered11MUW  2019-07-30     12

In [4]:
avail['date'] = pd.to_datetime(avail['date']) #convert date to datetime

In [5]:
avail['date'] = avail['date'].dt.date

In [6]:
trips = pd.read_csv('../data/tripscleaned.csv') #read in clean trips data
trips.head(3)

,Unnamed: 0,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt,startdatetime,enddatetime
0,0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,0 days 00:02:31.886666,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780,2019-05-01 00:00:20.460000,2019-05-01 00:02:52.346666
1,1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,0 days 00:01:42.936666,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757,2019-05-01 00:01:50.090000,2019-05-01 00:03:33.026666
2,2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,0 days 00:03:26.233333,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530,2019-05-01 00:03:47.363333,2019-05-01 00:07:13.596666

In [7]:
trips['date'] = pd.to_datetime(trips['startdate']).dt.date #adds date column for matching
trips.head(3)

,Unnamed: 0,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt,startdatetime,enddatetime,date
0,0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,0 days 00:02:31.886666,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780,2019-05-01 00:00:20.460000,2019-05-01 00:02:52.346666,2019-05-01
1,1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,0 days 00:01:42.936666,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757,2019-05-01 00:01:50.090000,2019-05-01 00:03:33.026666,2019-05-01
2,2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,0 days 00:03:26.233333,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530,2019-05-01 00:03:47.363333,2019-05-01 00:07:13.596666,2019-05-01

In [8]:
trip_count = trips.groupby(['companyname','sumdid','date']).size().reset_index().rename(columns={0:'tripcount'}) #trip count per day per scooter

In [9]:
use = pd.merge(avail,trip_count[['sumdid','date','tripcount']],on=['sumdid','date'], how='left') #merge datasets

In [10]:
use['tripcount_filled'] = use['tripcount'].fillna(0) #adds a new column replacing nan with zero

In [11]:
use.describe()

               count      tripcount  tripcount_filled
count  413563.000000  200608.000000     413563.000000
mean      177.515984       2.565740          1.244570
std        94.567047       1.853639          1.819611
min         1.000000       1.000000          0.000000
25%        95.000000       1.000000          0.000000
50%       170.000000       2.000000          0.000000
75%       285.000000       3.000000          2.000000
max       289.000000      18.000000         18.000000

In [12]:
use.groupby('companyname')[['tripcount','tripcount_filled']].mean() #show average use per scooter per day by company including and excluding nan values

             tripcount  tripcount_filled
companyname
Bird          1.903042          1.075261
Bolt          2.279776          1.311764
Gotcha        1.836404          0.148670
Jump          1.507518          0.058052
Lime          3.479329          2.466084
Lyft          2.946394          2.069340
Spin          2.092589          0.998607

In [13]:
use.value_counts('count').sort_index()

count
1        995
2        761
3        647
4        665
5        660
       ...
285     6237
286     9915
287    27663
288    63118
289       10
Length: 289, dtype: int64

In [14]:
unused = use.loc[use.tripcount_filled == 0] #scooters that weren't used at all on a day

In [15]:
underused = use.loc[(use.tripcount < 3) & (use.tripcount != 0)] #scooters that were used fewer than 3 times

In [16]:
suff_use = use.loc[use.tripcount >= 3] #scooters that were used at least 3 times